# =============================================================================
# 作者: 成照权
# 日期: 2024-12-9
# 描述: 模拟用户登录：
# 有一个保存用户账户信息的字典，请用程序模拟系统的登录验证过程。
# 请用程序实现：用键盘模拟用户输入，判断输入的用户名或密码是否正确，并输出登录信息。
# 如果输入的用户名存在，且密码正确，则输出success
# 如果输入的用户名存在，但密码不正确，则输出password error
# 如果输入的用户名不存在，则输出not found
# =============================================================================
user={
    '成照权':'123456',
    '张三':'1234567',
 }
name=input("name:")
password=input("password:")
if name in user:
    if user[name] == password:
        print("success")
    else:
        print("password error")
else:
    print("not found")